In [95]:
# Import packages.
import pandas as pd 
import numpy as np

In [96]:
# Create DataFrame and use the 'usecols' function to select columns to be used.
Metro_Pop_2020_DF1 = pd.read_csv('Project_2_Data/US_Pop_2020_CSV.csv', usecols= ['CBSA', 'NAME', 'LSAD', 'DATE', 'POPESTIMATE', 'POPEST_MALE', 'POPEST_FEMALE', 'MEDIAN_AGE_TOTAL', 'MEDIAN_AGE_MALE', 'MEDIAN_AGE_FEMALE'])

In [97]:
Metro_Pop_2020_DF1.head(7)

,CBSA,NAME,LSAD,DATE,POPESTIMATE,POPEST_MALE,POPEST_FEMALE,MEDIAN_AGE_TOTAL,MEDIAN_AGE_MALE,MEDIAN_AGE_FEMALE
0,10180,"Abilene, TX",Metropolitan Statistical Area,1,176579,89269,87310,34.1,33.2,35.2
1,10180,"Abilene, TX",Metropolitan Statistical Area,2,176809,89408,87401,34.2,33.2,35.2
2,10180,"Abilene, TX",Metropolitan Statistical Area,3,177314,89671,87643,34.3,33.5,35.3
3,10420,"Akron, OH",Metropolitan Statistical Area,1,702219,343286,358933,40.6,39.5,41.7
4,10420,"Akron, OH",Metropolitan Statistical Area,2,701305,342719,358586,40.6,39.6,41.7
5,10420,"Akron, OH",Metropolitan Statistical Area,3,700015,341789,358226,40.7,39.7,41.8
6,10500,"Albany, GA",Metropolitan Statistical Area,1,148922,70804,78118,37.5,35.9,38.9

In [98]:
# Use the 'rename' function to modify column names. 
Metro_Pop_2020_DF1.rename(columns={'NAME': 'City/Metro', 'POPESTIMATE': 'Estimated_Population', 'POPESTIMATE': 'Population', 'DATE': 'Date', 'POPEST_MALE': 'Male_Population', 'POPEST_FEMALE': 'Female_Population', 'MEDIAN_AGE_TOTAL': 'Median_Age_Total', 'MEDIAN_AGE_MALE': 'Median_Age_Male', 'MEDIAN_AGE_FEMALE': 'Median_Age_Female'}, inplace= True)

In [99]:
Metro_Pop_2020_DF1.head()

,CBSA,City/Metro,LSAD,Date,Population,Male_Population,Female_Population,Median_Age_Total,Median_Age_Male,Median_Age_Female
0,10180,"Abilene, TX",Metropolitan Statistical Area,1,176579,89269,87310,34.1,33.2,35.2
1,10180,"Abilene, TX",Metropolitan Statistical Area,2,176809,89408,87401,34.2,33.2,35.2
2,10180,"Abilene, TX",Metropolitan Statistical Area,3,177314,89671,87643,34.3,33.5,35.3
3,10420,"Akron, OH",Metropolitan Statistical Area,1,702219,343286,358933,40.6,39.5,41.7
4,10420,"Akron, OH",Metropolitan Statistical Area,2,701305,342719,358586,40.6,39.6,41.7

In [100]:
# Create new DataFrame and select specific portions of 'City/Metro' column using iloc. 
DF1_MetPop2020 = Metro_Pop_2020_DF1.iloc[[51, 126, 147, 204, 210, 258, 285, 291, 477, 489, 540, 591, 630, 633, 669, 675, 687, 690, 735, 744, 747, 780, 807, 810, 828, 927, 930, 933, 960, 1095]]

In [101]:
DF1_MetPop2020

,CBSA,City/Metro,LSAD,Date,Population,Male_Population,Female_Population,Median_Age_Total,Median_Age_Male,Median_Age_Female
51,12060,"Atlanta-Sandy Springs-Alpharetta, GA",Metropolitan Statistical Area,1,6089815,2957470,3132345,36.9,35.9,37.9
126,14460,"Boston-Cambridge-Newton, MA-NH",Metropolitan Statistical Area,1,4941632,2418046,2523586,38.8,37.8,39.9
147,15380,"Buffalo-Cheektowaga, NY",Metropolitan Statistical Area,1,1166902,569707,597195,40.8,39.4,42.3
204,16980,"Chicago-Naperville-Elgin, IL-IN-WI",Metropolitan Statistical Area,1,9618502,4739937,4878565,38.1,37.1,39.1
210,17140,"Cincinnati, OH-KY-IN",Metropolitan Statistical Area,1,2256884,1114630,1142254,38.1,37.1,39.1
258,19100,"Dallas-Fort Worth-Arlington, TX",Metropolitan Statistical Area,1,7637387,3779275,3858112,35.3,34.6,35.9
285,19740,"Denver-Aurora-Lakewood, CO",Metropolitan Statistical Area,1,2963821,1492321,1471500,36.9,36.4,37.5
291,19820,"Detroit-Warren-Dearborn, MI",Metropolitan Statistical Area,1,4392041,2153747,2238294,40.1,38.7,41.4
477,26420,"Houston-The Woodlands-Sugar Land, TX",Metropolitan Statistical Area,1,7122240,3548196,3574044,35.0,34.4,35.5
489,26900,"Indianapolis-Carmel-Anderson, IN",Metropolitan Statistical Area,1,2111040,1038774,1072266,36.7,35.8,37.6
540,28140,"Kansas City, MO-KS",Metropolitan Statistical Area,1,2192035,1082767,1109268,37.7,36.8,38.6
591,29820,"Las Vegas-Henderson-Paradise, NV",Metropolitan Statistical Area,1,2265461,1134726,1130735,37.8,37.3,38.3
630,31080,"Los Angeles-Long Beach-Anaheim, CA",Metropolitan Statistical Area,1,13200998,6546539,6654459,37.6,36.7,38.6
633,31140,"Louisville/Jefferson County, KY-IN",Metropolitan Statistical Area,1,1285439,631705,653734,39.2,38.1,40.3
669,32820,"Memphis, TN-MS-AR",Metropolitan Statistical Area,1,1337779,641509,696270,36.6,35.2,37.9
675,33100,"Miami-Fort Lauderdale-Pompano Beach, FL",Metropolitan Statistical Area,1,6138333,3005123,3133210,41.6,40.3,42.9
687,33340,"Milwaukee-Waukesha, WI",Metropolitan Statistical Area,1,1574731,772689,802042,38.3,37.4,39.2
690,33460,"Minneapolis-St. Paul-Bloomington, MN-WI",Metropolitan Statistical Area,1,3690261,1841756,1848505,37.5,36.9,38.2
735,34980,"Nashville-Davidson--Murfreesboro--Franklin, TN",Metropolitan Statistical Area,1,1989519,975573,1013946,36.8,36.0,37.4
744,35380,"New Orleans-Metairie, LA",Metropolitan Statistical Area,1,1271845,616081,655764,39.0,38.1,39.9
747,35620,"New York-Newark-Jersey City, NY-NJ-PA",Metropolitan Statistical Area,1,20140470,9811780,10328690,39.0,37.8,40.3
780,36740,"Orlando-Kissimmee-Sanford, FL",Metropolitan Statistical Area,1,2673376,1314143,1359233,37.9,37.0,38.8
807,37980,"Philadelphia-Camden-Wilmington, PA-NJ-DE-MD",Metropolitan Statistical Area,1,6245051,3040403,3204648,39.0,37.7,40.3
810,38060,"Phoenix-Mesa-Chandler, AZ",Metropolitan Statistical Area,1,4845832,2418925,2426907,37.3,36.4,38.3
828,38900,"Portland-Vancouver-Hillsboro, OR-WA",Metropolitan Statistical Area,1,2512859,1251332,1261527,38.7,38.0,39.3
927,41700,"San Antonio-New Braunfels, TX",Metropolitan Statistical Area,1,2558143,1272145,1285998,35.3,34.4,36.3
930,41740,"San Diego-Chula Vista-Carlsbad, CA",Metropolitan Statistical Area,1,3298634,1671043,1627591,36.5,35.5,37.7
933,41860,"San Francisco-Oakland-Berkeley, CA",Metropolitan Statistical Area,1,4749008,2365423,2383585,39.3,38.6,40.1
960,42660,"Seattle-Tacoma-Bellevue, WA",Metropolitan Statistical Area,1,4018762,2029293,1989469,37.2,36.5,37.9
1095,47900,"Washington-Arlington-Alexandria, DC-VA-MD-WV",Metropolitan Statistical Area,1,6385162,3141717,3243445,37.6,36.8,38.3

In [102]:
# Visualizing and understanding data.
Shape_of_MetPop2020 = DF1_MetPop2020.shape
print(Shape_of_MetPop2020)
Data_Types_of_MetPop2020 = DF1_MetPop2020.dtypes
print(Data_Types_of_MetPop2020)

(30, 10)
CBSA                   int64
City/Metro            object
LSAD                  object
Date                   int64
Population             int64
Male_Population        int64
Female_Population      int64
Median_Age_Total     float64
Median_Age_Male      float64
Median_Age_Female    float64
dtype: object

In [103]:
DF1_MetPop2020.head()

,CBSA,City/Metro,LSAD,Date,Population,Male_Population,Female_Population,Median_Age_Total,Median_Age_Male,Median_Age_Female
51,12060,"Atlanta-Sandy Springs-Alpharetta, GA",Metropolitan Statistical Area,1,6089815,2957470,3132345,36.9,35.9,37.9
126,14460,"Boston-Cambridge-Newton, MA-NH",Metropolitan Statistical Area,1,4941632,2418046,2523586,38.8,37.8,39.9
147,15380,"Buffalo-Cheektowaga, NY",Metropolitan Statistical Area,1,1166902,569707,597195,40.8,39.4,42.3
204,16980,"Chicago-Naperville-Elgin, IL-IN-WI",Metropolitan Statistical Area,1,9618502,4739937,4878565,38.1,37.1,39.1
210,17140,"Cincinnati, OH-KY-IN",Metropolitan Statistical Area,1,2256884,1114630,1142254,38.1,37.1,39.1

In [104]:
East_Coast_Metro_2020 = DF1_MetPop2020.iloc[[1, 2, 15, 20, 21, 22, 29]]

In [105]:
East_Coast_Metro_2020

,CBSA,City/Metro,LSAD,Date,Population,Male_Population,Female_Population,Median_Age_Total,Median_Age_Male,Median_Age_Female
126,14460,"Boston-Cambridge-Newton, MA-NH",Metropolitan Statistical Area,1,4941632,2418046,2523586,38.8,37.8,39.9
147,15380,"Buffalo-Cheektowaga, NY",Metropolitan Statistical Area,1,1166902,569707,597195,40.8,39.4,42.3
675,33100,"Miami-Fort Lauderdale-Pompano Beach, FL",Metropolitan Statistical Area,1,6138333,3005123,3133210,41.6,40.3,42.9
747,35620,"New York-Newark-Jersey City, NY-NJ-PA",Metropolitan Statistical Area,1,20140470,9811780,10328690,39.0,37.8,40.3
780,36740,"Orlando-Kissimmee-Sanford, FL",Metropolitan Statistical Area,1,2673376,1314143,1359233,37.9,37.0,38.8
807,37980,"Philadelphia-Camden-Wilmington, PA-NJ-DE-MD",Metropolitan Statistical Area,1,6245051,3040403,3204648,39.0,37.7,40.3
1095,47900,"Washington-Arlington-Alexandria, DC-VA-MD-WV",Metropolitan Statistical Area,1,6385162,3141717,3243445,37.6,36.8,38.3

In [106]:
East_Coast_Metro_2020['Population'].sum()

47690926

In [107]:
Midwest_MetPop_2020 = DF1_MetPop2020.iloc[[3, 4, 6, 7, 9, 10, 13, 16, 17]]

In [108]:
Midwest_MetPop_2020

,CBSA,City/Metro,LSAD,Date,Population,Male_Population,Female_Population,Median_Age_Total,Median_Age_Male,Median_Age_Female
204,16980,"Chicago-Naperville-Elgin, IL-IN-WI",Metropolitan Statistical Area,1,9618502,4739937,4878565,38.1,37.1,39.1
210,17140,"Cincinnati, OH-KY-IN",Metropolitan Statistical Area,1,2256884,1114630,1142254,38.1,37.1,39.1
285,19740,"Denver-Aurora-Lakewood, CO",Metropolitan Statistical Area,1,2963821,1492321,1471500,36.9,36.4,37.5
291,19820,"Detroit-Warren-Dearborn, MI",Metropolitan Statistical Area,1,4392041,2153747,2238294,40.1,38.7,41.4
489,26900,"Indianapolis-Carmel-Anderson, IN",Metropolitan Statistical Area,1,2111040,1038774,1072266,36.7,35.8,37.6
540,28140,"Kansas City, MO-KS",Metropolitan Statistical Area,1,2192035,1082767,1109268,37.7,36.8,38.6
633,31140,"Louisville/Jefferson County, KY-IN",Metropolitan Statistical Area,1,1285439,631705,653734,39.2,38.1,40.3
687,33340,"Milwaukee-Waukesha, WI",Metropolitan Statistical Area,1,1574731,772689,802042,38.3,37.4,39.2
690,33460,"Minneapolis-St. Paul-Bloomington, MN-WI",Metropolitan Statistical Area,1,3690261,1841756,1848505,37.5,36.9,38.2

In [109]:
Midwest_MetPop_2020['Population'].sum()

30084754

In [110]:
South_MetPop_2020 = DF1_MetPop2020.iloc[[0, 5, 8, 14, 18, 19, 25]]

In [111]:
South_MetPop_2020

,CBSA,City/Metro,LSAD,Date,Population,Male_Population,Female_Population,Median_Age_Total,Median_Age_Male,Median_Age_Female
51,12060,"Atlanta-Sandy Springs-Alpharetta, GA",Metropolitan Statistical Area,1,6089815,2957470,3132345,36.9,35.9,37.9
258,19100,"Dallas-Fort Worth-Arlington, TX",Metropolitan Statistical Area,1,7637387,3779275,3858112,35.3,34.6,35.9
477,26420,"Houston-The Woodlands-Sugar Land, TX",Metropolitan Statistical Area,1,7122240,3548196,3574044,35.0,34.4,35.5
669,32820,"Memphis, TN-MS-AR",Metropolitan Statistical Area,1,1337779,641509,696270,36.6,35.2,37.9
735,34980,"Nashville-Davidson--Murfreesboro--Franklin, TN",Metropolitan Statistical Area,1,1989519,975573,1013946,36.8,36.0,37.4
744,35380,"New Orleans-Metairie, LA",Metropolitan Statistical Area,1,1271845,616081,655764,39.0,38.1,39.9
927,41700,"San Antonio-New Braunfels, TX",Metropolitan Statistical Area,1,2558143,1272145,1285998,35.3,34.4,36.3

In [112]:
South_MetPop_2020['Population'].sum()

28006728

In [113]:
West_Coast_MetPop_2020 = DF1_MetPop2020.iloc[[11, 12, 23, 24, 26, 27, 28]]

In [114]:
West_Coast_MetPop_2020

,CBSA,City/Metro,LSAD,Date,Population,Male_Population,Female_Population,Median_Age_Total,Median_Age_Male,Median_Age_Female
591,29820,"Las Vegas-Henderson-Paradise, NV",Metropolitan Statistical Area,1,2265461,1134726,1130735,37.8,37.3,38.3
630,31080,"Los Angeles-Long Beach-Anaheim, CA",Metropolitan Statistical Area,1,13200998,6546539,6654459,37.6,36.7,38.6
810,38060,"Phoenix-Mesa-Chandler, AZ",Metropolitan Statistical Area,1,4845832,2418925,2426907,37.3,36.4,38.3
828,38900,"Portland-Vancouver-Hillsboro, OR-WA",Metropolitan Statistical Area,1,2512859,1251332,1261527,38.7,38.0,39.3
930,41740,"San Diego-Chula Vista-Carlsbad, CA",Metropolitan Statistical Area,1,3298634,1671043,1627591,36.5,35.5,37.7
933,41860,"San Francisco-Oakland-Berkeley, CA",Metropolitan Statistical Area,1,4749008,2365423,2383585,39.3,38.6,40.1
960,42660,"Seattle-Tacoma-Bellevue, WA",Metropolitan Statistical Area,1,4018762,2029293,1989469,37.2,36.5,37.9

In [115]:
West_Coast_MetPop_2020['Population'].sum()

34891554

In [116]:
Metro_Pop_2000_DF2 = pd.read_csv('Project_2_Data/Cen2010CSV.csv')

In [117]:
Metro_Pop_2000_DF2.head()

,Metropolitan statistical area,"April 1, 2000","April 1, 2010",Number,Percent,Unnamed: 5,Unnamed: 6
0,"Abilene, TX","160,245","165,252","5,007",3.1,NaN,NaN
1,"Akron, OH","694,960","703,200","8,240",1.2,NaN,NaN
2,"Albany, GA","157,833","157,308",-525,-0.3,NaN,NaN
3,"Albany-Schenectady-Troy, NY","825,875","870,716","44,841",5.4,NaN,NaN
4,"Albuquerque, NM","729,649","887,077","157,428",21.6,NaN,NaN

In [118]:
Metro_Pop_2000_DF2.rename(columns={'Metropolitan statistical area': 'City/Metro', 'April 1, 2000': 'Population_2000', 'April 1, 2010': 'Population_2010', 'Number': 'Pop_Difference'}, inplace= True)

In [119]:
Metro_Pop_2000_DF2.head()

,City/Metro,Population_2000,Population_2010,Pop_Difference,Percent,Unnamed: 5,Unnamed: 6
0,"Abilene, TX","160,245","165,252","5,007",3.1,NaN,NaN
1,"Akron, OH","694,960","703,200","8,240",1.2,NaN,NaN
2,"Albany, GA","157,833","157,308",-525,-0.3,NaN,NaN
3,"Albany-Schenectady-Troy, NY","825,875","870,716","44,841",5.4,NaN,NaN
4,"Albuquerque, NM","729,649","887,077","157,428",21.6,NaN,NaN

In [120]:
Metro_Pop_2000_DF2.drop(columns= ['Percent', 'Unnamed: 5', 'Unnamed: 6'], inplace= True)

In [121]:
Shape_Of_MetPop_2000 = Metro_Pop_2000_DF2.shape
print(Shape_Of_MetPop_2000)
Data_Types_MetPop_2000 = Metro_Pop_2000_DF2.dtypes
print(Data_Types_MetPop_2000)

(973, 4)
City/Metro         object
Population_2000    object
Population_2010    object
Pop_Difference     object
dtype: object

In [122]:
Metro_Pop_2000_DF2.head()

                    City/Metro Population_2000 Population_2010 Pop_Difference
0                  Abilene, TX         160,245         165,252          5,007
1                    Akron, OH         694,960         703,200          8,240
2                   Albany, GA         157,833         157,308           -525
3  Albany-Schenectady-Troy, NY         825,875         870,716         44,841
4              Albuquerque, NM         729,649         887,077        157,428

In [123]:
Metro_Pop_2000_DF2.dtypes

City/Metro         object
Population_2000    object
Population_2010    object
Pop_Difference     object
dtype: object

In [124]:
# Remove comma from columns and convert from object to float64.
Metro_Pop_2000_DF2['Population_2000'] = pd.to_numeric(Metro_Pop_2000_DF2['Population_2000'].replace({',': ''}, regex= True)) 
Metro_Pop_2000_DF2['Population_2010'] = pd.to_numeric(Metro_Pop_2000_DF2['Population_2010'].replace({',': ''}, regex= True)) 
Metro_Pop_2000_DF2['Pop_Difference'] = pd.to_numeric(Metro_Pop_2000_DF2['Pop_Difference'].replace({',': ''}, regex= True))

In [125]:
Metro_Pop_2000_DF2.head()

,City/Metro,Population_2000,Population_2010,Pop_Difference
0,"Abilene, TX",160245.0,165252.0,5007.0
1,"Akron, OH",694960.0,703200.0,8240.0
2,"Albany, GA",157833.0,157308.0,-525.0
3,"Albany-Schenectady-Troy, NY",825875.0,870716.0,44841.0
4,"Albuquerque, NM",729649.0,887077.0,157428.0

In [126]:
Metro_Pop_2000_DF2.dtypes

City/Metro          object
Population_2000    float64
Population_2010    float64
Pop_Difference     float64
dtype: object

In [127]:
DF2_Metro_Pop2000 = Metro_Pop_2000_DF2.iloc[[18, 41, 48, 64, 66, 82, 91, 93, 149, 153, 169, 186, 199, 200, 212, 214, 217, 218, 233, 235, 236, 247, 258, 259, 265, 298, 299, 301, 310, 349]]

In [128]:
DF2_Metro_Pop2000.head()

,City/Metro,Population_2000,Population_2010,Pop_Difference
18,"Atlanta-Sandy Springs-Marietta, GA",4247981.0,5268860.0,1020879.0
41,"Boston-Cambridge-Quincy, MA-NH",4391344.0,4552402.0,161058.0
48,"Buffalo-Niagara Falls, NY",1170111.0,1135509.0,-34602.0
64,"Chicago-Joliet-Naperville, IL-IN-WI",9098316.0,9461105.0,362789.0
66,"Cincinnati-Middletown, OH-KY-IN",2009632.0,2130151.0,120519.0

In [129]:
DF2_Metro_Pop2000.dtypes

City/Metro          object
Population_2000    float64
Population_2010    float64
Pop_Difference     float64
dtype: object

In [130]:
East_Coast_MetroPop_2000 = DF2_Metro_Pop2000.iloc[[1, 2, 15, 20, 21, 22, 29]]

In [131]:
East_Coast_MetroPop_2000

,City/Metro,Population_2000,Population_2010,Pop_Difference
41,"Boston-Cambridge-Quincy, MA-NH",4391344.0,4552402.0,161058.0
48,"Buffalo-Niagara Falls, NY",1170111.0,1135509.0,-34602.0
214,"Miami-Fort Lauderdale-Pompano Beach, FL",5007564.0,5564635.0,557071.0
236,"New York-Northern New Jersey-Long Island, NY-N...",18323002.0,18897109.0,574107.0
247,"Orlando-Kissimmee-Sanford, FL",1644561.0,2134411.0,489850.0
258,"Philadelphia-Camden-Wilmington, PA-NJ-DE-MD",5687147.0,5965343.0,278196.0
349,"Washington-Arlington-Alexandria, DC-VA-MD-WV",4796183.0,5582170.0,785987.0

In [132]:
East_Coast_MetroPop_2000['Population_2000'].sum()

41019912.0

In [133]:
Midwest_MetPop_2000 = DF2_Metro_Pop2000.iloc[[3, 4, 6, 7, 9, 10, 13, 16, 17]]

In [134]:
Midwest_MetPop_2000

,City/Metro,Population_2000,Population_2010,Pop_Difference
64,"Chicago-Joliet-Naperville, IL-IN-WI",9098316.0,9461105.0,362789.0
66,"Cincinnati-Middletown, OH-KY-IN",2009632.0,2130151.0,120519.0
91,"Denver-Aurora-Broomfield, CO /1",2179240.0,2543482.0,364242.0
93,"Detroit-Warren-Livonia, MI",4452557.0,4296250.0,-156307.0
153,"Indianapolis-Carmel, IN",1525104.0,1756241.0,231137.0
169,"Kansas City, MO-KS",1836038.0,2035334.0,199296.0
200,"Louisville/Jefferson County, KY-IN",1161975.0,1283566.0,121591.0
217,"Milwaukee-Waukesha-West Allis, WI",1500741.0,1555908.0,55167.0
218,"Minneapolis-St. Paul-Bloomington, MN-WI",2968806.0,3279833.0,311027.0

In [139]:
Midwest_MetPop_2000['Population_2000'].sum()

26732409.0

In [135]:
South_MetPop_2000 = DF2_Metro_Pop2000.iloc[[0, 5, 8, 14, 18, 19, 25]]

In [136]:
South_MetPop_2000

,City/Metro,Population_2000,Population_2010,Pop_Difference
18,"Atlanta-Sandy Springs-Marietta, GA",4247981.0,5268860.0,1020879.0
82,"Dallas-Fort Worth-Arlington, TX",5161544.0,6371773.0,1210229.0
149,"Houston-Sugar Land-Baytown, TX",4715407.0,5946800.0,1231393.0
212,"Memphis, TN-MS-AR",1205204.0,1316100.0,110896.0
233,"Nashville-Davidson--Murfreesboro--Franklin, TN",1311789.0,1589934.0,278145.0
235,"New Orleans-Metairie-Kenner, LA",1316510.0,1167764.0,-148746.0
298,"San Antonio-New Braunfels, TX",1711703.0,2142508.0,430805.0

In [137]:
West_Coast_MetPop_2000 = DF2_Metro_Pop2000.iloc[[11, 12, 23, 24, 26, 27, 28]]

In [138]:
West_Coast_MetPop_2000

,City/Metro,Population_2000,Population_2010,Pop_Difference
186,"Las Vegas-Paradise, NV",1375765.0,1951269.0,575504.0
199,"Los Angeles-Long Beach-Santa Ana, CA",12365627.0,12828837.0,463210.0
259,"Phoenix-Mesa-Glendale, AZ",3251876.0,4192887.0,941011.0
265,"Portland-Vancouver-Hillsboro, OR-WA",1927881.0,2226009.0,298128.0
299,"San Diego-Carlsbad-San Marcos, CA",2813833.0,3095313.0,281480.0
301,"San Francisco-Oakland-Fremont, CA",4123740.0,4335391.0,211651.0
310,"Seattle-Tacoma-Bellevue, WA",3043878.0,3439809.0,395931.0